In [18]:
# importing module
import cx_Oracle

In [27]:
#KPI-UMAKANTYADA 1521

con = cx_Oracle.connect('UMA/root1@KPI-UMAKANTYADA:1521/xe')

In [28]:
#print connection version
print(con.version)

11.2.0.2.0

In [29]:
# Now execute the sqlquery
cursor = con.cursor()

In [30]:
import pandas as pd

In [31]:
 # Creating a table employee
cursor.execute("create table employee(empid integer primary key, name varchar2(30), salary number(10, 2))")
con.commit()

In [32]:
cursor.execute("INSERT INTO employee(empid,name,salary) \
      VALUES (1, 'Paul',20000.00 )");

cursor.execute("INSERT INTO employee(empid,name,salary) \
      VALUES (2, 'Allen',15000.00 )");

cursor.execute("INSERT INTO employee(empid,name,salary) \
      VALUES (3, 'Teddy',20000.00 )");

cursor.execute("INSERT INTO employee(empid,name,salary) \
      VALUES (4, 'Mark',65000.00 )");

con.commit()

In [33]:
df=pd.read_sql('select * from employee',con)

In [34]:
df

   EMPID   NAME   SALARY
0      1   Paul  20000.0
1      2  Allen  15000.0
2      3  Teddy  20000.0
3      4   Mark  65000.0